HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCan_reg.h
/** \\brief  23A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO157_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3A4u)

/** Alias (User Manual Name) for CAN_MO157_FGPR.
* To use register names with standard convension, please use CAN_MO157_FGPR.
*/
#define	CAN_MOFGPR157	(CAN_MO157_FGPR)

/** \\brief  23A8, Message Object  Interrupt Pointer Register */
#define CAN_MO157_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3A8u)

/** Alias (User Manual Name) for CAN_MO157_IPR.
* To use register names with standard convension, please use CAN_MO157_IPR.
*/
#define	CAN_MOIPR157	(CAN_MO157_IPR)

/** \\brief  23BC, Message Object  Control Register */
#define CAN_MO157_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A3BCu)

/** Alias (User Manual Name) for CAN_MO157_STAT.
* To use register names with standard convension, please use CAN_MO157_STAT.
*/
#define	CAN_MOSTAT157	(CAN_MO157_STAT)

/** \\brief  23CC, Message Object  Acceptance Mask Register */
#define CAN_MO158_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3CCu)

/** Alias (User Manual Name) for CAN_MO158_AMR.
* To use register names with standard convension, please use CAN_MO158_AMR.
*/
#define	CAN_MOAMR158	(CAN_MO158_AMR)

/** \\brief  23D8, Message Object  Arbitration Register */
#define CAN_MO158_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3D8u)

/** Alias (User Manual Name) for CAN_MO158_AR.
* To use register names with standard convension, please use CAN_MO158_AR.
*/
#define	CAN_MOAR158	(CAN_MO158_AR)

/** \\brief  23DC, Message Object  Control Register */
#define CAN_MO158_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A3DCu)

/** Alias (User Manual Name) for CAN_MO158_CTR.
* To use register names with standard convension, please use CAN_MO158_CTR.
*/
#define	CAN_MOCTR158	(CAN_MO158_CTR)

/** \\brief  23D4, Message Object  Data Register High */
#define CAN_MO158_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3D4u)

/** Alias (User Manual Name) for CAN_MO158_DATAH.
* To use register names with standard convension, please use CAN_MO158_DATAH.
*/
#define	CAN_MODATAH158	(CAN_MO158_DATAH)

/** \\brief  23D0, Message Object  Data Register Low */
#define CAN_MO158_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3D0u)

/** Alias (User Manual Name) for CAN_MO158_DATAL.
* To use register names with standard convension, please use CAN_MO158_DATAL.
*/
#define	CAN_MODATAL158	(CAN_MO158_DATAL)

/** \\brief  23C0, Message Object  Function Control Register */
#define CAN_MO158_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3C0u)

/** Alias (User Manual Name) for CAN_MO158_FCR.
* To use register names with standard convension, please use CAN_MO158_FCR.
*/
#define	CAN_MOFCR158	(CAN_MO158_FCR)

/** \\brief  23C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO158_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3C4u)

/** Alias (User Manual Name) for CAN_MO158_FGPR.
* To use register names with standard convension, please use CAN_MO158_FGPR.
*/
#define	CAN_MOFGPR158	(CAN_MO158_FGPR)

/** \\brief  23C8, Message Object  Interrupt Pointer Register */
#define CAN_MO158_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3C8u)

/** Alias (User Manual Name) for CAN_MO158_IPR.
* To use register names with standard convension, please use CAN_MO158_IPR.
*/
#define	CAN_MOIPR158	(CAN_MO158_IPR)

/** \\brief  23DC, Message Object  Control Register */
#define CAN_MO158_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A3DCu)

/** Alias (User Manual Name) for CAN_MO158_STAT.
* To use register names with standard convension, please use CAN_MO158_STAT.
*/
#define	CAN_MOSTAT158	(CAN_MO158_STAT)

/** \\brief  23EC, Message Object  Acceptance Mask Register */
#define CAN_MO159_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3ECu)

/** Alias (User Manual Name) for CAN_MO159_AMR.
* To use register names with standard convension, please use CAN_MO159_AMR.
*/
#define	CAN_MOAMR159	(CAN_MO159_AMR)

/** \\brief  23F8, Message Object  Arbitration Register */
#define CAN_MO159_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3F8u)

/** Alias (User Manual Name) for CAN_MO159_AR.
* To use register names with standard convension, please use CAN_MO159_AR.
*/
#define	CAN_MOAR159	(CAN_MO159_AR)

/** \\brief  23FC, Message Object  Control Register */
#define CAN_MO159_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A3FCu)

/** Alias (User Manual Name) for CAN_MO159_CTR.
* To use register names with standard convension, please use CAN_MO159_CTR.
*/
#define	CAN_MOCTR159	(CAN_MO159_CTR)

/** \\brief  23F4, Message Object  Data Register High */
#define CAN_MO159_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3F4u)

/** Alias (User Manual Name) for CAN_MO159_DATAH.
* To use register names with standard convension, please use CAN_MO159_DATAH.
*/
#define	CAN_MODATAH159	(CAN_MO159_DATAH)

/** \\brief  23F0, Message Object  Data Register Low */
#define CAN_MO159_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3F0u)

/** Alias (User Manual Name) for CAN_MO159_DATAL.
* To use register names with standard convension, please use CAN_MO159_DATAL.
*/
#define	CAN_MODATAL159	(CAN_MO159_DATAL)

/** \\brief  23E0, Message Object  Function Control Register */
#define CAN_MO159_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3E0u)

/** Alias (User Manual Name) for CAN_MO159_FCR.
* To use register names with standard convension, please use CAN_MO159_FCR.
*/
#define	CAN_MOFCR159	(CAN_MO159_FCR)

/** \\brief  23E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO159_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3E4u)

/** Alias (User Manual Name) for CAN_MO159_FGPR.
* To use register names with standard convension, please use CAN_MO159_FGPR.
*/
#define	CAN_MOFGPR159	(CAN_MO159_FGPR)

/** \\brief  23E8, Message Object  Interrupt Pointer Register */
#define CAN_MO159_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3E8u)

