HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO202_FCR.
* To use register names with standard convension, please use CAN_MO202_FCR.
*/
#define	CAN_MOFCR202	(CAN_MO202_FCR)

/** \\brief  2944, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO202_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A944u)

/** Alias (User Manual Name) for CAN_MO202_FGPR.
* To use register names with standard convension, please use CAN_MO202_FGPR.
*/
#define	CAN_MOFGPR202	(CAN_MO202_FGPR)

/** \\brief  2948, Message Object  Interrupt Pointer Register */
#define CAN_MO202_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A948u)

/** Alias (User Manual Name) for CAN_MO202_IPR.
* To use register names with standard convension, please use CAN_MO202_IPR.
*/
#define	CAN_MOIPR202	(CAN_MO202_IPR)

/** \\brief  295C, Message Object  Control Register */
#define CAN_MO202_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A95Cu)

/** Alias (User Manual Name) for CAN_MO202_STAT.
* To use register names with standard convension, please use CAN_MO202_STAT.
*/
#define	CAN_MOSTAT202	(CAN_MO202_STAT)

/** \\brief  296C, Message Object  Acceptance Mask Register */
#define CAN_MO203_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A96Cu)

/** Alias (User Manual Name) for CAN_MO203_AMR.
* To use register names with standard convension, please use CAN_MO203_AMR.
*/
#define	CAN_MOAMR203	(CAN_MO203_AMR)

/** \\brief  2978, Message Object  Arbitration Register */
#define CAN_MO203_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A978u)

/** Alias (User Manual Name) for CAN_MO203_AR.
* To use register names with standard convension, please use CAN_MO203_AR.
*/
#define	CAN_MOAR203	(CAN_MO203_AR)

/** \\brief  297C, Message Object  Control Register */
#define CAN_MO203_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A97Cu)

/** Alias (User Manual Name) for CAN_MO203_CTR.
* To use register names with standard convension, please use CAN_MO203_CTR.
*/
#define	CAN_MOCTR203	(CAN_MO203_CTR)

/** \\brief  2974, Message Object  Data Register High */
#define CAN_MO203_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A974u)

/** Alias (User Manual Name) for CAN_MO203_DATAH.
* To use register names with standard convension, please use CAN_MO203_DATAH.
*/
#define	CAN_MODATAH203	(CAN_MO203_DATAH)

/** \\brief  2970, Message Object  Data Register Low */
#define CAN_MO203_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A970u)

/** Alias (User Manual Name) for CAN_MO203_DATAL.
* To use register names with standard convension, please use CAN_MO203_DATAL.
*/
#define	CAN_MODATAL203	(CAN_MO203_DATAL)

/** \\brief  2960, Message Object  Function Control Register */
#define CAN_MO203_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A960u)

/** Alias (User Manual Name) for CAN_MO203_FCR.
* To use register names with standard convension, please use CAN_MO203_FCR.
*/
#define	CAN_MOFCR203	(CAN_MO203_FCR)

/** \\brief  2964, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO203_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A964u)

/** Alias (User Manual Name) for CAN_MO203_FGPR.
* To use register names with standard convension, please use CAN_MO203_FGPR.
*/
#define	CAN_MOFGPR203	(CAN_MO203_FGPR)

/** \\brief  2968, Message Object  Interrupt Pointer Register */
#define CAN_MO203_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A968u)

/** Alias (User Manual Name) for CAN_MO203_IPR.
* To use register names with standard convension, please use CAN_MO203_IPR.
*/
#define	CAN_MOIPR203	(CAN_MO203_IPR)

/** \\brief  297C, Message Object  Control Register */
#define CAN_MO203_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A97Cu)

/** Alias (User Manual Name) for CAN_MO203_STAT.
* To use register names with standard convension, please use CAN_MO203_STAT.
*/
#define	CAN_MOSTAT203	(CAN_MO203_STAT)

/** \\brief  298C, Message Object  Acceptance Mask Register */
#define CAN_MO204_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A98Cu)

/** Alias (User Manual Name) for CAN_MO204_AMR.
* To use register names with standard convension, please use CAN_MO204_AMR.
*/
#define	CAN_MOAMR204	(CAN_MO204_AMR)

/** \\brief  2998, Message Object  Arbitration Register */
#define CAN_MO204_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A998u)

/** Alias (User Manual Name) for CAN_MO204_AR.
* To use register names with standard convension, please use CAN_MO204_AR.
*/
#define	CAN_MOAR204	(CAN_MO204_AR)

/** \\brief  299C, Message Object  Control Register */
#define CAN_MO204_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A99Cu)

/** Alias (User Manual Name) for CAN_MO204_CTR.
* To use register names with standard convension, please use CAN_MO204_CTR.
*/
#define	CAN_MOCTR204	(CAN_MO204_CTR)

/** \\brief  2994, Message Object  Data Register High */
#define CAN_MO204_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A994u)

/** Alias (User Manual Name) for CAN_MO204_DATAH.
* To use register names with standard convension, please use CAN_MO204_DATAH.
*/
#define	CAN_MODATAH204	(CAN_MO204_DATAH)

/** \\brief  2990, Message Object  Data Register Low */
#define CAN_MO204_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A990u)

/** Alias (User Manual Name) for CAN_MO204_DATAL.
* To use register names with standard convension, please use CAN_MO204_DATAL.
*/
#define	CAN_MODATAL204	(CAN_MO204_DATAL)

/** \\brief  2980, Message Object  Function Control Register */
#define CAN_MO204_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A980u)

/** Alias (User Manual Name) for CAN_MO204_FCR.
* To use register names with standard convension, please use CAN_MO204_FCR.
*/
#define	CAN_MOFCR204	(CAN_MO204_FCR)

/** \\brief  2984, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO204_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A984u)

/** Alias (User Manual Name) for CAN_MO204_FGPR.
* To use register names with standard convension, please use CAN_MO204_FGPR.
*/
#define	CAN_MOFGPR204	(CAN_MO204_FGPR)

/** \\brief  2988, Message Object  Interrupt Pointer Register */
#define CAN_MO204_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A988u)

/** Alias (User Manual Name) for CAN_MO204_IPR.
* To use register names with standard convension, please use CAN_MO204_IPR.
*/
#define	CAN_MOIPR204	(CAN_MO204_IPR)

/** \\brief  299C, Message Object  Control Register */
#define CAN_MO204_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A99Cu)

