HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCan_reg.h
/** \\brief  2A30, Message Object  Data Register Low */
#define CAN_MO209_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA30u)

/** Alias (User Manual Name) for CAN_MO209_DATAL.
* To use register names with standard convension, please use CAN_MO209_DATAL.
*/
#define	CAN_MODATAL209	(CAN_MO209_DATAL)

/** \\brief  2A20, Message Object  Function Control Register */
#define CAN_MO209_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA20u)

/** Alias (User Manual Name) for CAN_MO209_FCR.
* To use register names with standard convension, please use CAN_MO209_FCR.
*/
#define	CAN_MOFCR209	(CAN_MO209_FCR)

/** \\brief  2A24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO209_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA24u)

/** Alias (User Manual Name) for CAN_MO209_FGPR.
* To use register names with standard convension, please use CAN_MO209_FGPR.
*/
#define	CAN_MOFGPR209	(CAN_MO209_FGPR)

/** \\brief  2A28, Message Object  Interrupt Pointer Register */
#define CAN_MO209_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA28u)

/** Alias (User Manual Name) for CAN_MO209_IPR.
* To use register names with standard convension, please use CAN_MO209_IPR.
*/
#define	CAN_MOIPR209	(CAN_MO209_IPR)

/** \\brief  2A3C, Message Object  Control Register */
#define CAN_MO209_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AA3Cu)

/** Alias (User Manual Name) for CAN_MO209_STAT.
* To use register names with standard convension, please use CAN_MO209_STAT.
*/
#define	CAN_MOSTAT209	(CAN_MO209_STAT)

/** \\brief  128C, Message Object  Acceptance Mask Register */
#define CAN_MO20_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001928Cu)

/** Alias (User Manual Name) for CAN_MO20_AMR.
* To use register names with standard convension, please use CAN_MO20_AMR.
*/
#define	CAN_MOAMR20	(CAN_MO20_AMR)

/** \\brief  1298, Message Object  Arbitration Register */
#define CAN_MO20_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019298u)

/** Alias (User Manual Name) for CAN_MO20_AR.
* To use register names with standard convension, please use CAN_MO20_AR.
*/
#define	CAN_MOAR20	(CAN_MO20_AR)

/** \\brief  129C, Message Object  Control Register */
#define CAN_MO20_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001929Cu)

/** Alias (User Manual Name) for CAN_MO20_CTR.
* To use register names with standard convension, please use CAN_MO20_CTR.
*/
#define	CAN_MOCTR20	(CAN_MO20_CTR)

/** \\brief  1294, Message Object  Data Register High */
#define CAN_MO20_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019294u)

/** Alias (User Manual Name) for CAN_MO20_DATAH.
* To use register names with standard convension, please use CAN_MO20_DATAH.
*/
#define	CAN_MODATAH20	(CAN_MO20_DATAH)

/** \\brief  1290, Message Object  Data Register Low */
#define CAN_MO20_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019290u)

/** Alias (User Manual Name) for CAN_MO20_DATAL.
* To use register names with standard convension, please use CAN_MO20_DATAL.
*/
#define	CAN_MODATAL20	(CAN_MO20_DATAL)

/** \\brief  1280, Message Object  Function Control Register */
#define CAN_MO20_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019280u)

/** Alias (User Manual Name) for CAN_MO20_FCR.
* To use register names with standard convension, please use CAN_MO20_FCR.
*/
#define	CAN_MOFCR20	(CAN_MO20_FCR)

/** \\brief  1284, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO20_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019284u)

/** Alias (User Manual Name) for CAN_MO20_FGPR.
* To use register names with standard convension, please use CAN_MO20_FGPR.
*/
#define	CAN_MOFGPR20	(CAN_MO20_FGPR)

/** \\brief  1288, Message Object  Interrupt Pointer Register */
#define CAN_MO20_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019288u)

/** Alias (User Manual Name) for CAN_MO20_IPR.
* To use register names with standard convension, please use CAN_MO20_IPR.
*/
#define	CAN_MOIPR20	(CAN_MO20_IPR)

/** \\brief  129C, Message Object  Control Register */
#define CAN_MO20_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001929Cu)

/** Alias (User Manual Name) for CAN_MO20_STAT.
* To use register names with standard convension, please use CAN_MO20_STAT.
*/
#define	CAN_MOSTAT20	(CAN_MO20_STAT)

/** \\brief  2A4C, Message Object  Acceptance Mask Register */
#define CAN_MO210_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AA4Cu)

/** Alias (User Manual Name) for CAN_MO210_AMR.
* To use register names with standard convension, please use CAN_MO210_AMR.
*/
#define	CAN_MOAMR210	(CAN_MO210_AMR)

/** \\brief  2A58, Message Object  Arbitration Register */
#define CAN_MO210_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AA58u)

/** Alias (User Manual Name) for CAN_MO210_AR.
* To use register names with standard convension, please use CAN_MO210_AR.
*/
#define	CAN_MOAR210	(CAN_MO210_AR)

/** \\brief  2A5C, Message Object  Control Register */
#define CAN_MO210_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AA5Cu)

/** Alias (User Manual Name) for CAN_MO210_CTR.
* To use register names with standard convension, please use CAN_MO210_CTR.
*/
#define	CAN_MOCTR210	(CAN_MO210_CTR)

/** \\brief  2A54, Message Object  Data Register High */
#define CAN_MO210_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AA54u)

/** Alias (User Manual Name) for CAN_MO210_DATAH.
* To use register names with standard convension, please use CAN_MO210_DATAH.
*/
#define	CAN_MODATAH210	(CAN_MO210_DATAH)

/** \\brief  2A50, Message Object  Data Register Low */
#define CAN_MO210_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AA50u)

/** Alias (User Manual Name) for CAN_MO210_DATAL.
* To use register names with standard convension, please use CAN_MO210_DATAL.
*/
#define	CAN_MODATAL210	(CAN_MO210_DATAL)

/** \\brief  2A40, Message Object  Function Control Register */
#define CAN_MO210_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AA40u)

/** Alias (User Manual Name) for CAN_MO210_FCR.
* To use register names with standard convension, please use CAN_MO210_FCR.
*/
#define	CAN_MOFCR210	(CAN_MO210_FCR)

/** \\brief  2A44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO210_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AA44u)

/** Alias (User Manual Name) for CAN_MO210_FGPR.
* To use register names with standard convension, please use CAN_MO210_FGPR.
*/
#define	CAN_MOFGPR210	(CAN_MO210_FGPR)

/** \\brief  2A48, Message Object  Interrupt Pointer Register */
#define CAN_MO210_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AA48u)

